[
    {
        "id": 1,
        "image": "../Images/Bodyshape.jpg",
        "projectName": "Bodyshape",
        "technologies": [
            "HTML",
            "CSS",
            "Responsive Design",
            "Font Awesome"
        ],
        "detailInfo": "A responsive fitness landing page built with HTML and Tailwind CSS. Features include trainer highlights, gym benefits, custom tag grids, and a branded footer. Designed for clarity, scalability, and modern UI. Ideal for showcasing fitness programs and attracting new clients with clean visuals and mobile-first layout.",
        "githubLink": "https://github.com/KINGALVI/Bodyshape",
        "liveLink": ""
    },
    {
        "id": 2,
        "image": "../Images/BD-Help-Organization.jpg",
        "projectName": "BD Help Organization",
        "technologies": [
            "HTML",
            "CSS"
        ],
        "detailInfo": "BD-Donate-Organization is a humanitarian platform supporting vulnerable communities in Bangladesh through donations for food, shelter, and education. Built with HTML, CSS, and JavaScript, it ensures a responsive and transparent experience, allowing donors to make meaningful contributions and create lasting change for those in urgent need.",
        "githubLink": "https://github.com/KINGALVI/BD-Help-Organization",
        "liveLink": "https://shiny-begonia-2c3462.netlify.app/"
    },
    {
        "id": 3,
        "image": "../Images/Panda-Commerce.jpg",
        "projectName": "Panda Commerce",
        "technologies": [
            "HTML",
            "CSS",
            "Bootstrap CSS"
        ],
        "detailInfo": "Panda Commerce is a modern, responsive e-commerce platform built with HTML, CSS (Bootstrap & Tailwind), and JavaScript. It features interactive UI components, an optimized product showcase, and seamless navigation for a smooth shopping experience. Perfect for learning and implementing best practices in web development and design!",
        "githubLink": "https://github.com/KINGALVI/Panda-Commerce",
        "liveLink": "https://singular-fox-7c85d9.netlify.app/"
    },
    {
        "id": 4,
        "image": "/Images/Penguin Fashion.jpg",
        "projectName": "Penguin Fashion",
        "technologies": [
            "HTML",
            "CSS",
            "Responsive Design",
            "Tailwind CSS"
        ],
        "detailInfo": "Penguin Fashion is a modern e-commerce website for winter apparel, built with Tailwind CSS and JavaScript for a sleek, responsive UI. It features interactive product listings, dynamic pricing, and an intuitive shopping experience, ensuring seamless browsing across mobile and desktop with a clean, user-friendly interface !!",
        "githubLink": "https://github.com/KINGALVI/Penguin-Fashion",
        "liveLink": "https://thunderous-gumdrop-dc3ee9.netlify.app/"
    },
    {
        "id": 5,
        "image": "/Images/edTech-Education.jpg",
        "projectName": "edTech Education",
        "technologies": [
            "HTML",
            "CSS",
            "Responsive Design",
            "Bootstrap CSS"
        ],
        "detailInfo": "edTech Education is a modern, responsive online learning platform designed to enhance educational experiences. It features structured courses, student success stories, interactive FAQs, and seamless UI. Built with HTML, Bootstrap CSS, JavaScript, and GitHub for version control, it delivers dynamic and accessible learning opportunities !!",
        "githubLink": "https://github.com/KINGALVI/edTech-Education",
        "liveLink": "https://timely-semolina-0cd1c9.netlify.app/"
    },
    {
        "id": 6,
        "image": "/Images/Super-Bank.jpg",
        "projectName": "Super Bank",
        "technologies": [
            "HTML",
            "CSS",
            "JavaScript"
        ],
        "detailInfo": "",
        "githubLink": "https://github.com/KINGALVI/Super-Bank",
        "liveLink": "https://calm-souffle-dadbc3.netlify.app/"
    },
    {
        "id": 7,
        "image": "/Images/Shopping Cart.jpg",
        "projectName": "Shopping Cart",
        "technologies": [
            "HTML",
            "CSS",
            "JavaScript",
            "Tailwind CSS"
        ],
        "detailInfo": "A dynamic shopping cart UI built with HTML, CSS (Bootstrap), and JavaScript. Users can modify item quantities, remove products, and track real-time pricing updates, including taxes. The checkout process features interactive modals for purchase confirmation, ensuring smooth, accessible, and user-friendly shopping experience for e-commerce platform .",
        "githubLink": "https://github.com/KINGALVI/Shopping-Cart",
        "liveLink": "https://elegant-puppy-c4fdf0.netlify.app/"
    },
    {
        "id": 8,
        "image": "/Images/scorer-king-vector.jpg",
        "projectName": "Scorer King Vector",
        "technologies": [
            "HTML",
            "CSS"
        ],
        "detailInfo": "This project represents the Bangladesh flag using HTML and CSS. It features a responsive design with a green background and a centered red circle, created using Flexbox for alignment and scalable dimensions. A clean structure and modern styling make it perfect for learning CSS layout techniques and enhancing UI design skills.",
        "githubLink": "https://github.com/KINGALVI/BANGLADESH-FLAG",
        "liveLink": "https://magnificent-kulfi-34c791.netlify.app/"
    }
]